tutorials/legacy/combustion/PDRFoam/flamePropagationWithObstacles/0/Nv.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Nv;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar>
8025
(
2.019581
0.019581
0.134791
2.051662
2.219372
0.019581
0
0
...
)
;

boundaryField
{
    outer
    {
        type            uniformInletOutlet;
        uniformInletValue 0;
        value           uniform 0;
    }

    ground
    {
        type            zeroGradient;
    }

    blockedFaces
    {
        type            zeroGradient;
        value           uniform 0;
    }

    baffleWall
    {
        type            zeroGradient;
        value           uniform 0;
    }

    baffleCyclic_half0
    {
        type            cyclic;
    }

    baffleCyclic_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
